#include "lcd1602.h"



/*******************************************************************/
/*                                                                                                                                  */
/* 延时子程序                                                                                                                  */
/*                                                                                                                                  */
/*******************************************************************/

void delay(int ms)
{                           
   int i;
   while(ms--)
   {
     for(i = 0; i< 250; i++)
     {
      _nop_();
      _nop_();
      _nop_();
      _nop_();
     }
   }
}

/*******************************************************************/
/*                                                                                                                                  */
/*检查LCD忙状态                                                                                                             */
/*lcd_busy为1时，忙，等待。lcd-busy为0时,闲，可写指令与数据。                                      */
/*                                                                                                                                  */
/*******************************************************************/

bit lcd_busy()
{                          
    bit result;
    LCD_RS = 0;
    LCD_RW = 1;
    LCD_EN = 1;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
     result = (bit)(P0&0x80);
    LCD_EN = 0;
    return result; 
}

/*******************************************************************/
/*                                                                                                                                  */
/*写指令数据到LCD                                                                                                          */
/*RS=L，RW=L，E=高脉冲，D0-D7=指令码。                                                                   */
/*                                                                                                                                   */
/*******************************************************************/

void lcd_wcmd(uchar cmd)
{                          
   while(lcd_busy());
    LCD_RS = 0;
    LCD_RW = 0;
    LCD_EN = 0;
    _nop_();
    _nop_(); 
    P0 = cmd;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    LCD_EN = 1;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    LCD_EN = 0;  
}

/*******************************************************************/
/*                                                                                                                                  */
/*写显示数据到LCD                                                                                                          */
/*RS=H，RW=L，E=高脉冲，D0-D7=数据。                                                                     */
/*                                                                                                                                  */
/*******************************************************************/

void lcd_wdat(uchar dat) 
{                          
   while(lcd_busy());
    LCD_RS = 1;
    LCD_RW = 0;
    LCD_EN = 0;
    P0 = dat;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    LCD_EN = 1;
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    LCD_EN = 0; 
}

/*******************************************************************/
/*                                                                                                                                  */
/*  设定显示位置                                                                                                              */
/*                                                                                                                                  */
/*******************************************************************/

void lcd_pos(uchar pos)
{                          
   lcd_wcmd(pos|0x80);      //数据指针=80+地址变量
}

/*******************************************************************/
/*                                                                                                                                  */
/*  LCD初始化设定                                                                                                           */
/*                                                                                                                                  */
/*******************************************************************/

void lcd_init()
{ 
    delay(15);                     //等待LCD电源稳定        
    lcd_wcmd(0x38);          //16*2显示，5*7点阵，8位数据
    delay(5);
    lcd_wcmd(0x38);         
    delay(5);
    lcd_wcmd(0x38);         
    delay(5);

    lcd_wcmd(0x0c);          //显示开，关光标
    delay(5);
    lcd_wcmd(0x06);          //移动光标
    delay(5);
    lcd_wcmd(0x01);          //清除LCD的显示内容
    delay(5);
}

void lcd_ui_screen(void)
{
	 lcd_pos(0x00);
	 lcd_wdat('f');
	 lcd_wdat('r');
	 lcd_wdat('e');
	 lcd_wdat('q');
	 lcd_wdat(':');
	
	 lcd_pos(0x05);
	 lcd_wdat(' ');
	 lcd_wdat('1');
	 lcd_wdat('.');
	 lcd_wdat('0');
	 lcd_wdat('k');
	 lcd_wdat('H');
	 lcd_wdat('z');
	
	 lcd_pos(0x40);
	 lcd_wdat('d');
	 lcd_wdat('u');
	 lcd_wdat('t');
	 lcd_wdat('y');
	 lcd_wdat(':');
	
	 lcd_pos(0x47);
	 lcd_wdat(' ');
	 lcd_wdat('5');
	 lcd_wdat('0');
	 lcd_wdat('%');

	
}

